cases/MICP/precipitation/c=3e-1/0/CNH4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CNH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    left
    {
       //  type            fixedValue;
     //  value	       uniform 1;
 type           zeroGradient;
    }

    right
    {
         type           zeroGradient;
    }

    bottom
    {
       type            cyclic;
    }
    top
    {
        type            cyclic;
    }


    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
